app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  ORDER BY created_at DESC  [["post_id", 13]]
---

                <% if @post.comments.length > 0 %>