app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])

    @post.comments.create(comments_param)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 17]]
INSERT INTO "comments" ("name", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "new comm "], ["body", "great great article"], ["post_id", 17], ["created_at", "2016-03-04 18:20:52.497819"], ["updated_at", "2016-03-04 18:20:52.497819"]]