app/controllers/posts_controller.rb

UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "First post "], ["body", "Woohoo"], ["updated_at", "2016-03-04 00:11:43.368195"], ["id", 1]]
---
  def update
    if @post.update_attributes(post_params)